config/Reports/Курьеры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Report>
		<Properties>
			<Name>Курьеры</Name>
		</Properties>
	</Report>
</MetaDataObject>

config/AccumulationRegisters/УчетДенегВИнтернетАптеке.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<AccumulationRegister>
		<Properties>
			<Name>УчетДенегВИнтернетАптеке</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Фирма</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Фирмы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Курьер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Курьеры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗаказОтПокупателя</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ИнтернетЗаказ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

config/Reports/Курьеры/Ext/ObjectModule.bsl
Процедура Сформировать_ВедомостьПоЗаказамУКурьеров(Фирма,Аптека,Курьер=Неопределено,КонПериода=Неопределено) Экспорт
	
	Если КонПериода=Неопределено ТОгда
		КонПериода=КонецДня(ТекущаяДата());
	Иначе
		КонПериода=КонецДня(КонПериода);
	КонецЕсли;	
	
	
		
	//---------------<>---------------------------// GtG // 28.08.2012 15:18:39
	Построитель=Новый ПостроительЗапроса;
	
	Построитель.Текст=("ВЫБРАТЬ
	                   |	УчетДенегВИнтернетАптекеОстатки.Фирма КАК Фирма,
	                   |	УчетДенегВИнтернетАптекеОстатки.Склад КАК Склад,
	                   |	УчетДенегВИнтернетАптекеОстатки.Курьер КАК Курьер,
	                   |	УчетДенегВИнтернетАптекеОстатки.ЗаказОтПокупателя КАК Заказ,
	                   |	УчетДенегВИнтернетАптекеОстатки.СуммаОстаток КАК Сумма,
	                   |	ВЫБОР
	                   |		КОГДА УчетДенегВИнтернетАптекеОстатки.ЗаказОтПокупателя.ДатаОтгрузки < УчетДенегВИнтернетАптекеОстатки.ЗаказОтПокупателя.Дата
	                   |			ТОГДА УчетДенегВИнтернетАптекеОстатки.ЗаказОтПокупателя.Дата
	                   |		ИНАЧЕ УчетДенегВИнтернетАптекеОстатки.ЗаказОтПокупателя.ДатаОтгрузки
	                   |	КОНЕЦ КАК ДатаДоставки
	                   |ИЗ
	                   |	РегистрНакопления.УчетДенегВИнтернетАптеке.Остатки(
	                   |			&КонПериода,
	                   |			Фирма = Фирма
	                   |				И Склад = Склад {(Курьер)}) КАК УчетДенегВИнтернетАптекеОстатки
	                   |
	                   |УПОРЯДОЧИТЬ ПО
	                   |	Фирма,
	                   |	Склад,
	                   |	Курьер,
	                   |	ДатаДоставки,
	                   |	УчетДенегВИнтернетАптекеОстатки.ЗаказОтПокупателя.НомерЗаказа");
						
						
						
						
	Запрос=Построитель.ПолучитьЗапрос();					
	
	Запрос.УстановитьПараметр("КонПериода",КонецДня(КонПериода));
	
	Запрос.УстановитьПараметр("Фирма",Фирма);
	
	Запрос.УстановитьПараметр("Склад",Аптека);
	если Курьер<>Неопределено тогда
			Запрос.УстановитьПараметр("Курьер",Курьер);
	КонецЕсли;


	
	РЕз=Запрос.Выполнить().Выгрузить();
	
	РезКурьер=Рез.Скопировать();
	РезКурьер.Свернуть("Курьер","Сумма");
	
	
	
	Таб=Новый ТабличныйДокумент;
	Макет=ЭтотОбъект.ПолучитьМакет("ДолгиПоКурьерамКраткий");
	
	Область=Макет.ПолучитьОбласть("Шапка");
	Область.Параметры.Фирма	= Фирма;			
	Область.Параметры.Аптека= Аптека;
	Область.Параметры.Дата	= Формат(КонПериода,"ДЛФ=D");			
	
	Таб.Вывести(Область);
	
	//---------------<>---------------------------// GtG // 28.08.2012 16:06:40
	Для Каждого Стр Из РезКурьер Цикл
		Область=Макет.ПолучитьОбласть("Курьер");
		Область.Параметры.Заполнить(Стр);
		Таб.Вывести(Область);
		СтрокиЗаказов=Рез.НайтиСтроки(Новый Структура("Курьер",стр.курьер));
		Для Каждого СтрЗаказа из СтрокиЗаказов Цикл
			
			Область=Макет.ПолучитьОбласть("Заказ");
			Область.Параметры.Заполнить(СтрЗаказа);
			Область.Параметры.ДатаДоставки	= Формат(СтрЗаказа.ДатаДоставки,"ДЛФ=D");			
			Таб.Вывести(Область);
		КонецЦикла;	
	КонецЦикла;	
	
	Область=Макет.ПолучитьОбласть("Итоги");
	Область.Параметры.Сумма=РезКурьер.Итог("Сумма");
	Таб.Вывести(Область);
	
	
	
	
	
	//---------------<>---------------------------// GtG // 28.08.2012 16:06:28
	Таб.ОтображатьЗаголовки=Ложь;
	Таб.ОтображатьСетку=Ложь;
	Таб.ТолькоПросмотр=Истина;
	Таб.Показать("Ведомость по курьерам");
	
Конецпроцедуры
